# Python3 Project

import multiprocessing
from pymongo import MongoClient
from urllib.request import urlopen, Request
from bs4 import BeautifulSoup
import time

# ##===================== url =========================## #
web_urls = ["http://www.weather.com.cn/textFC/hb.shtml",  # 华北
            "http://www.weather.com.cn/textFC/db.shtml",  # 东北
            "http://www.weather.com.cn/textFC/hd.shtml",  # 华东
            "http://www.weather.com.cn/textFC/hz.shtml",  # 华中
            "http://www.weather.com.cn/textFC/hn.shtml",  # 华南
            "http://www.weather.com.cn/textFC/xb.shtml",  # 西北
            "http://www.weather.com.cn/textFC/xn.shtml",  # 西南
            "http://www.weather.com.cn/textFC/gat.shtml"]  # 港澳台
# ##===================== url end ======================## #

# ##===================== city name end ======================## #
cities_name = {
    "北京": "北京",
    "海淀": "海淀区",
    "朝阳": "朝阳区",
    "顺义": "顺义区",
    "怀柔": "怀柔区",
    "通州": "通州区",
    "昌平": "昌平区",
    "延庆": "延庆区",
    "丰台": "丰台区",
    "石景山": "石景山区",
    "大兴": "大兴区",
    "房山": "房山区",
    "密云": "密云区",
    "门头沟": "门头沟区",
    "平谷": "平谷区",
    "东城": "东城区",
    "西城": "西城区",
    "天津": "天津",
    "武清": "武清区",
    "宝坻": "宝坻区",
    "东丽": "东丽区",
    "西青": "西青区",
    "北辰": "北辰区",
    "宁河": "宁河区",
    "和平": "和平区",
    "静海": "静海区",
    "津南": "津南区",
    "滨海新区": "滨海新区",
    "河东": "河东区",
    "河西": "河西区",
    "蓟州": "蓟州区",
    "南开": "南开区",
    "河北": "河北",
    "红桥": "红桥市",
    "石家庄": "石家庄市",
    "保定": "保定市",
    "张家口": "张家口市",
    "承德": "承德市",
    "唐山": "唐山市",
    "廊坊": "廊坊市",
    "沧州": "沧州市",
    "衡水": "衡水市",
    "邢台": "邢台市",
    "邯郸": "邯郸市",
    "秦皇岛": "秦皇岛市",
    "雄安新区": "雄安新区",
    "太原": "太原市",
    "大同": "大同市",
    "阳泉": "阳泉市",
    "晋中": "晋中市",
    "长治": "长治市",
    "晋城": "晋城市",
    "临汾": "临汾市",
    "运城": "运城市",
    "朔州": "朔州市",
    "忻州": "忻州市",
    "吕梁": "吕梁市",
    "呼和浩特": "呼和浩特市",
    "包头": "包头市",
    "乌海": "乌海市",
    "乌兰察布": "乌兰察布市",
    "通辽": "通辽市",
    "赤峰": "赤峰市",
    "鄂尔多斯": "鄂尔多斯市",
    "巴彦淖尔": "巴彦淖尔市",
    "锡林郭勒": "锡林郭勒盟",
    "呼伦贝尔": "呼伦贝尔市",
    "兴安盟": "兴安盟",
    "阿拉善盟": "阿拉善盟",
    "哈尔滨": "哈尔滨市",
    "齐齐哈尔": "齐齐哈尔市",
    "牡丹江": "牡丹江市",
    "佳木斯": "佳木斯市",
    "绥化": "绥化市",
    "黑河": "黑河市",
    "大兴安岭": "大兴安岭地区",
    "伊春": "伊春市",
    "大庆": "大庆市",
    "七台河": "七台河市",
    "鸡西": "鸡西市",
    "鹤岗": "鹤岗市",
    "双鸭山": "双鸭山市",
    "长春": "长春市",
    "吉林": "吉林市",
    "延边": "延边朝鲜族自治州",
    "四平": "四平市",
    "通化": "通化市",
    "白城": "白城市",
    "辽源": "辽源市",
    "松原": "松原市",
    "白山": "白山市",
    "沈阳": "沈阳市",
    "大连": "大连市",
    "鞍山": "鞍山市",
    "抚顺": "抚顺市",
    "本溪": "本溪市",
    "丹东": "丹东市",
    "锦州": "锦州市",
    "营口": "营口市",
    "阜新": "阜新市",
    "辽阳": "辽阳市",
    "铁岭": "铁岭市",
    "朝阳1": "朝阳市",
    "盘锦": "盘锦市",
    "葫芦岛": "葫芦岛市",
    "上海": "上海",
    "闵行": "闵行区",
    "宝山": "宝山区",
    "黄浦": "黄浦区",
    "嘉定": "嘉定区",
    "浦东新区": "浦东新区",
    "金山": "金山区",
    "青浦": "青浦区",
    "松江": "松江区",
    "奉贤": "奉贤区",
    "崇明": "崇明区",
    "徐汇": "徐汇区",
    "长宁": "长宁区",
    "静安": "静安区",
    "普陀": "普陀区",
    "虹口": "虹口区",
    "杨浦": "杨浦区",
    "合肥": "合肥市",
    "蚌埠": "蚌埠市",
    "芜湖": "芜湖市",
    "淮南": "淮南市",
    "马鞍山": "马鞍山市",
    "安庆": "安庆市",
    "宿州": "宿州市",
    "阜阳": "阜阳市",
    "亳州": "亳州市",
    "黄山": "黄山市",
    "滁州": "滁州市",
    "淮北": "淮北市",
    "铜陵": "铜陵市",
    "宣城": "宣城市",
    "六安": "六安市",
    "池州": "池州市",
    "南京": "南京市",
    "无锡": "无锡市",
    "镇江": "镇江市",
    "苏州": "苏州市",
    "南通": "南通市",
    "扬州": "扬州市",
    "盐城": "盐城市",
    "徐州": "徐州市",
    "淮安": "淮安市",
    "连云港": "连云港市",
    "常州": "常州市",
    "泰州": "泰州市",
    "宿迁": "宿迁市",
    "济南": "济南市",
    "青岛": "青岛市",
    "淄博": "淄博市",
    "德州": "德州市",
    "烟台": "烟台市",
    "潍坊": "潍坊市",
    "济宁": "济宁市",
    "泰安": "泰安市",
    "临沂": "临沂市",
    "菏泽": "菏泽市",
    "滨州": "滨州市",
    "东营": "东营市",
    "威海": "威海市",
    "枣庄": "枣庄市",
    "日照": "日照市",
    "莱芜": "莱芜市",
    "聊城": "聊城市",
    "杭州": "杭州市",
    "湖州": "湖州市",
    "嘉兴": "嘉兴市",
    "宁波": "宁波市",
    "绍兴": "绍兴市",
    "台州": "台州市",
    "温州": "温州市",
    "丽水": "丽水市",
    "金华": "金华市",
    "衢州": "衢州市",
    "舟山": "舟山市",
    "福州": "福州市",
    "厦门": "厦门市",
    "宁德": "宁德市",
    "莆田": "莆田市",
    "泉州": "泉州市",
    "漳州": "漳州市",
    "龙岩": "龙岩市",
    "三明": "三明市",
    "南平": "南平市",
    "钓鱼岛": "中国属钓鱼岛",
    "南昌": "南昌市",
    "九江": "九江市",
    "上饶": "上饶市",
    "抚州": "抚州市",
    "宜春": "宜春市",
    "吉安": "吉安市",
    "赣州": "赣州市",
    "景德镇": "景德镇市",
    "萍乡": "萍乡市",
    "新余": "新余市",
    "鹰潭": "鹰潭市",
    "武汉": "武汉市",
    "襄阳": "襄阳市",
    "鄂州": "鄂州市",
    "孝感": "孝感市",
    "黄冈": "黄冈市",
    "黄石": "黄石市",
    "咸宁": "咸宁市",
    "荆州": "荆州市",
    "宜昌": "宜昌市",
    "恩施": "恩施土家族苗族自治州",
    "十堰": "十堰市",
    "神农架": "神农架林区",
    "随州": "随州市",
    "荆门": "荆门市",
    "天门": "天门市",
    "仙桃": "仙桃市",
    "潜江": "潜江市",
    "长沙": "长沙市",
    "湘潭": "湘潭市",
    "株洲": "株洲市",
    "衡阳": "衡阳市",
    "郴州": "郴州市",
    "常德": "常德市",
    "益阳": "益阳市",
    "娄底": "娄底市",
    "邵阳": "邵阳市",
    "岳阳": "岳阳市",
    "张家界": "张家界市",
    "怀化": "怀化市",
    "永州": "永州市",
    "湘西": "湘西土家族苗族自治州",
    "郑州": "郑州市",
    "安阳": "安阳市",
    "新乡": "新乡市",
    "许昌": "许昌市",
    "平顶山": "平顶山市",
    "信阳": "信阳市",
    "南阳": "南阳市",
    "开封": "开封市",
    "洛阳": "洛阳市",
    "商丘": "商丘市",
    "焦作": "焦作市",
    "鹤壁": "鹤壁市",
    "濮阳": "濮阳市",
    "周口": "周口市",
    "漯河": "漯河市",
    "驻马店": "驻马店市",
    "三门峡": "三门峡市",
    "济源": "济源市",
    "南宁": "南宁市",
    "崇左": "崇左市",
    "柳州": "柳州市",
    "来宾": "来宾市",
    "桂林": "桂林市",
    "梧州": "梧州市",
    "贺州": "贺州市",
    "贵港": "贵港市",
    "玉林": "玉林市",
    "百色": "百色市",
    "钦州": "钦州市",
    "河池": "河池市",
    "北海": "北海市",
    "防城港": "防城港市",
    "广州": "广州市",
    "韶关": "韶关市",
    "惠州": "惠州市",
    "梅州": "梅州市",
    "汕头": "汕头市",
    "深圳": "深圳市",
    "珠海": "珠海市",
    "佛山": "佛山市",
    "肇庆": "肇庆市",
    "湛江": "湛江市",
    "江门": "江门市",
    "河源": "河源市",
    "清远": "清远市",
    "云浮": "云浮市",
    "潮州": "潮州市",
    "东莞": "东莞市",
    "中山": "中山市",
    "阳江": "阳江市",
    "揭阳": "揭阳市",
    "茂名": "茂名市",
    "汕尾": "汕尾市",
    "海口": "海口市",
    "三亚": "三亚市",
    "东方": "东方市",
    "临高": "临高县",
    "澄迈": "澄迈县",
    "儋州": "儋州县",
    "昌江": "昌江黎族自治县",
    "白沙": "白沙黎族自治县",
    "琼中": "琼中黎族苗族自治县",
    "定安": "定安县",
    "屯昌": "屯昌县",
    "琼海": "琼海市",
    "文昌": "文昌市",
    "保亭": "保亭黎族苗族自治县",
    "万宁": "万宁市",
    "陵水": "陵水黎族自治县",
    "乐东": "乐东黎族自治县",
    "五指山": "五指山市",
    "西沙": "三沙市",
    "中沙": "三沙市",
    "南沙": "三沙市",
    "西安": "西安市",
    "咸阳": "咸阳市",
    "延安": "延安市",
    "榆林": "榆林市",
    "渭南": "渭南市",
    "商洛": "商洛市",
    "安康": "安康市",
    "汉中": "汉中市",
    "宝鸡": "宝鸡市",
    "铜川": "铜川市",
    "杨凌": "杨凌市",
    "兰州": "兰州市",
    "定西": "定西市",
    "平凉": "平凉市",
    "庆阳": "庆阳市",
    "武威": "武威市",
    "金昌": "金昌市",
    "张掖": "张掖市",
    "酒泉": "酒泉市",
    "天水": "天水市",
    "陇南": "陇南市",
    "临夏": "临夏回族自治州",
    "甘南": "甘南藏族自治州",
    "白银": "白银市",
    "嘉峪关": "嘉峪关市",
    "乌鲁木齐": "乌鲁木齐市",
    "克拉玛依": "克拉玛依市",
    "石河子": "石河子市",
    "昌吉": "昌吉回族自治州",
    "吐鲁番": "吐鲁番市",
    "巴音郭楞": "巴音郭楞蒙古自治州",
    "阿拉尔": "阿拉尔市",
    "阿克苏": "阿克苏地区",
    "喀什": "喀什地区",
    "伊犁": "伊犁哈萨克自治州",
    "塔城": "塔城地区",
    "哈密": "哈密市",
    "和田": "和田地区",
    "阿勒泰": "阿勒泰地区",
    "克州": "克州",
    "博尔塔拉": "博尔塔拉蒙古自治州",
    "图木舒克": "图木舒克市",
    "五家渠": "五家渠市",
    "铁门关": "铁门关市",
    "北屯": "北屯市",
    "双河": "双河市",
    "可克达拉": "可克达拉市",
    "西宁": "西宁市",
    "海东": "海东市",
    "黄南": "黄南藏族自治州",
    "海南": "海南藏族自治州",
    "果洛": "果洛藏族自治州",
    "玉树": "玉树藏族自治州",
    "海西": "海西蒙古族藏族自治州",
    "海北": "海北藏族自治州",
    "银川": "银川市",
    "石嘴山": "石嘴山市",
    "吴忠": "吴忠市",
    "固原": "固原市",
    "中卫": "中卫市",
    "成都": "成都市",
    "攀枝花": "攀枝花市",
    "自贡": "自贡市",
    "绵阳": "绵阳市",
    "南充": "南充市",
    "达州": "达州市",
    "遂宁": "遂宁市",
    "广安": "广安市",
    "巴中": "巴中市",
    "泸州": "泸州市",
    "宜宾": "宜宾市",
    "内江": "内江市",
    "资阳": "资阳市",
    "乐山": "乐山市",
    "眉山": "眉山市",
    "凉山": "凉山彝族自治州",
    "雅安": "雅安市",
    "甘孜": "甘孜藏族自治州",
    "阿坝": "阿坝藏族羌族自治州",
    "德阳": "德阳市",
    "广元": "广元市",
    "重庆": "重庆",
    "永川": "永川区",
    "合川": "合川区",
    "南川": "南川区",
    "江津": "江津区",
    "渝北": "渝北区",
    "北碚": "北碚区",
    "巴南": "巴南区",
    "长寿": "长寿区",
    "黔江": "黔江区",
    "渝中": "渝中区",
    "万州": "万州区",
    "涪陵": "涪陵区",
    "城口": "城口县",
    "云阳": "云阳县",
    "巫溪": "巫溪县",
    "奉节": "奉节县",
    "巫山": "巫山县",
    "潼南": "潼南区",
    "垫江": "垫江县",
    "梁平": "梁平县",
    "忠县": "忠县",
    "石柱": "石柱土家族自治县",
    "大足": "大足区",
    "荣昌": "荣昌区",
    "铜梁": "铜梁区",
    "璧山": "璧山区",
    "丰都": "丰都县",
    "武隆": "武隆县",
    "彭水": "彭水苗族土家族自治县",
    "綦江": "綦江区",
    "酉阳": "酉阳土家族苗族自治县",
    "大渡口": "大渡口",
    "秀山": "秀山",
    "江北": "江北",
    "沙坪坝": "沙坪坝",
    "九龙坡": "九龙坡",
    "南岸": "南岸",
    "开州": "开州",
    "贵阳": "贵阳市",
    "遵义": "遵义市",
    "安顺": "安顺市",
    "黔南": "黔南布依族苗族自治州",
    "黔东南": "黔东南苗族侗族自治州",
    "铜仁": "铜仁市",
    "毕节": "毕节市",
    "六盘水": "六盘水市",
    "黔西南": "黔西南布依族苗族自治州",
    "昆明": "昆明市",
    "大理": "大理白族自治州",
    "红河": "红河哈尼族彝族自治州",
    "曲靖": "曲靖市",
    "保山": "保山市",
    "文山": "文山壮族苗族自治州",
    "玉溪": "玉溪市",
    "楚雄": "楚雄彝族自治州",
    "普洱": "普洱市",
    "昭通": "昭通市",
    "临沧": "临沧市",
    "怒江": "怒江傈傈族自治州",
    "迪庆": "迪庆藏族自治州",
    "丽江": "丽江市",
    "德宏": "德宏傣族景颇族自治州",
    "西双版纳": "西双版纳傣族自治州",
    "拉萨": "拉萨市",
    "日喀则": "日喀则市",
    "山南": "山南市",
    "林芝": "林芝市",
    "昌都": "昌都市",
    "那曲": "那曲地区",
    "阿里": "阿里地区",
    "香港": "香港",
    "澳门": "澳门",
    "台北": "台北市",
    "高雄": "高雄市",
    "台中": "台中市"
}
# ##===================== city name end ======================## #


class operateMongoDb:
    """
    操作 mongodb 数据库
    """

    def __init__(self):
        """
        连接 mongodb 数据库
        """
        self.conn = MongoClient('127.0.0.1', 27017)

    def db_collection(self):
        """
        连接操作数据库
        """
        conn = self.conn
        db = conn['cities_weather']  # 连接 cities_weather 数据库，没有则自动创建
        # 连接到集合
        my_set = db['weather']
        return my_set

    def close_mongodb(self):
        """
        关闭数据库连接
        """
        conn = self.conn
        conn.close()


def get_web_info(web_url, lock):
    """
    爬取天气信息相关网页
    """
    om = operateMongoDb()
    user_agent = 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/67.0.3396.99 Safari/537.36'
    headers = {'User-Agent': user_agent}
    req = Request(web_url, headers=headers)
    html = urlopen(req)
    web_html = html.read().decode("utf8")   # 编码
    bsObj = BeautifulSoup(web_html, 'lxml')    # 将web_html对象转化为BeautifulSoup对象
    # cities_weather = {}
    divLists_p = bsObj.findAll("div", {"class": "conMidtab"})
    for divList_p in divLists_p:
        divLists = divList_p.findAll("div", {"class": "conMidtab2"})    # 找到所有class为conMidtab2的div
        for divList in divLists:
            provence_name = divList.find("td", {"class": "rowsPan"}).a.string
            # print(provence_name)
            # print(divList)
            city_list = []
            weather_list = []
            wind_list = []
            wind_power_list = []
            city_weather = []
            # 城市名称
            tdLists = divList.findAll("td", {"width": "83"})
            for tdList in tdLists:
                # print(tdList)
                if tdList.findAll("a"):
                    # print(tdList.a.string)
                    city_name = tdList.a.string
                    if city_name in cities_name:
                        city_name = cities_name[city_name]
                    city_list.append(city_name)
            # 城市天气
            tdLists_w = divList.findAll("td", {"width": "89"})
            for tdList_w in tdLists_w:
                # print(tdList_w.string)
                if tdList_w.string != "天气现象":
                    # 晚间时，白天的天气信息数据已不存在
                    if tdList_w.string == '-':
                        tdLists_w = divList.findAll("td", {"width": "98"})
                        for tdList_w in tdLists_w:
                            if tdList_w.string != "天气现象":
                                weather_list.append(tdList_w.string)
                        break
                    weather_list.append(tdList_w.string)
            # 城市风向及风力级别
            tdLists_wind = divList.findAll("td", {"width": "162"})
            for tdList_wind in tdLists_wind:
                if tdList_wind.string != "风向风力":
                    tdLists_ws = tdList_wind.findAll('span')
                    if tdLists_ws[0].string == '-':
                        tdLists_wind = divList.findAll("td", {"width": "177"})
                        for tdList_wind in tdLists_wind:
                            if tdList_wind.string != "风向风力":
                                tdLists_ws = tdList_wind.findAll('span')
                                wind_list.append(tdLists_ws[0].string)
                                wind_power_list.append(tdLists_ws[1].string)
                        break
                    wind_list.append(tdLists_ws[0].string)
                    wind_power_list.append(tdLists_ws[1].string)
            # 城市名称和天气、风向、风力组合
            # print(city_list)
            # print(weather_list)
            for i in range(len(city_list)):
                dict_tmp = {
                    'name': city_list[i],
                    'value': weather_list[i],
                    'wind': wind_list[i],
                    'wind_power': wind_power_list[i]
                }
                city_weather.append(dict_tmp)
            # print(city_weather)
            # cities_weather[provence_name] = city_weather
            with lock:
                my_set = om.db_collection()
                result = my_set.find_one({'provenceName': provence_name})
                # print(provence_name)
                if result:
                    my_set.update({'provenceName': provence_name}, {'provenceName': provence_name, 'value': city_weather})
                else:
                    my_set.insert({'provenceName': provence_name, 'value': city_weather})
        break
    om.close_mongodb()
    time.sleep(1)


def main():
    """
    主函数
    """
    lock = multiprocessing.Lock()
    # 创建进程
    pro_list = []
    print('----  数据采集开始时间： ' + time.strftime('%Y-%m-%d %H:%M:%S', time.localtime()) + '  ----')
    print("开始采集网络数据...")
    for web_url in web_urls:
        p = multiprocessing.Process(target=get_web_info, args=(web_url, lock))
        pro_list.append(p)
        p.start()
        print('进程创建运行中...')
    for pro in pro_list:
        pro.join()
    print("网络数据采集完毕!")
    print('----  数据采集结束时间： ' + time.strftime('%Y-%m-%d %H:%M:%S', time.localtime()) + '  ----', end='\n\n')


if __name__ == '__main__':
    while True:
        main()
        time.sleep(600)
